# PathReinforcementType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PathReinforcement..::..PathReinforcementType Property
PathReinforcement Class See Also
---
Retrieves the type of the Path Reinforcement.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public PathReinforcementType PathReinforcementType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property PathReinforcementType As PathReinforcementType
	Get
```

Visual C++
---
```text
public:
property PathReinforcementType^ PathReinforcementType {
	PathReinforcementType^ get ();
}
```

# See Also
PathReinforcement Class
Autodesk.Revit.DB.Structure Namespace